Autodesk.Revit.DB.Structure.BarTerminationsData.GetDocument
Gets the document containing the hook type ids, end treatment ids and crank type ids.
Returns:
Returns the document containing the hook type ids, end treatment ids and crank type ids.
Since:
2026

Autodesk.Revit.DB.Structure.BarTerminationsData.AsRebarShapeTerminationsData
Creates a new instance of RebarShapeTerminationsData from this.
Returns:
Returns a new instance of RebarShapeTerminationsData from this.
Since:
2026

Autodesk.Revit.DB.Structure.BarTerminationsData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.BarTerminationsData.CrankTypeIdAtEnd
Identifies the crank type at the end of bar.
Setting this property to a valid value, will set the HookTypeIdAtEnd and EndTreatmentTypeIdAtEnd to ElementId.InvalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: crankTypeIdAtEnd doesn't represent a crank type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Structure.BarTerminationsData.CrankTypeIdAtStart
Identifies the crank type at the start of bar.
Setting this property to a valid value, will set the HookTypeIdAtStart and EndTreatmentTypeIdAtStart to ElementId.InvalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: crankTypeIdAtStart doesn't represent a crank type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Structure.BarTerminationsData.EndTreatmentTypeIdAtEnd
Identifies the end treatment type at the end of bar.
Setting this property to a valid value, will set the CrankTypeIdAtEnd and HookTypeIdAtEnd to ElementId.InvalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: endTreatmentTypeIdAtEnd doesn't represent an end treatment type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Structure.BarTerminationsData.EndTreatmentTypeIdAtStart
Identifies the end treatment type at the start of bar.
Setting this property to a valid value, will set the CrankTypeIdAtStart and HookTypeIdAtStart to ElementId.InvalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: endTreatmentTypeIdAtStart doesn't represent an end treatment type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Structure.BarTerminationsData.HookTypeIdAtEnd
Identifies the hook type at the end of bar.
Setting this property to a valid value, will set the CrankTypeIdAtEnd and EndTreatmentTypeIdAtEnd to ElementId.InvalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: hookTypeIdAtEnd doesn't represent a hook type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Structure.BarTerminationsData.HookTypeIdAtStart
Identifies the hook type at the start of bar.
Setting this property to a valid value, will set the CrankTypeIdAtStart and EndTreatmentTypeIdAtStart to ElementId.InvalidElementId
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: hookTypeIdAtStart doesn't represent a hook type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Structure.BarTerminationsData.TerminationRotationAngleAtEnd
Identifies the termination's (e.g. hook, crank) out of plane rotation angle (in radians) at the end of bar.
The default value is 0.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for terminationRotationAngleAtEnd is not finite
Since:
2026

Autodesk.Revit.DB.Structure.BarTerminationsData.TerminationRotationAngleAtStart
Identifies the termination's (e.g. hook, crank) out of plane rotation angle (in radians) at the start of bar.
The default value is 0.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for terminationRotationAngleAtStart is not finite
Since:
2026

Autodesk.Revit.DB.Structure.BarTerminationsData.TerminationOrientationAtEnd
Identifies the orientation of the termination's (e.g. hook, crank) plane at the end of the bar with respect to the orientation of the last curve and the plane normal.
Only two values are permitted:
Value = Right: The termination is on your right as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."
Value = Left: The termination is on your left as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."
The default value is Left.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.Structure.BarTerminationsData.TerminationOrientationAtStart
Identifies the orientation of the termination's (e.g. hook, crank) plane at the start of the bar with respect to the orientation of the first curve and the plane normal.
Only two values are permitted:
Value = Right: The termination is on your right as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."
Value = Left: The termination is on your left as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."
The default value is Left.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.Structure.BarTerminationsData.#ctor(Autodesk.Revit.DB.Document)
Creates a new instance of BarTerminationData with the default values.
document:
The document containing the hook type ids, end treatment ids and crank type ids.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Structure.BarTerminationsData
Class that stores data about reinforcement's terminations (e.g. hooks, cranks, end treatments)
Since:
2026